Revit 2027 API
ParameterTypeId.LinePen Property
 "Line Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinePen { get; }
Public Shared ReadOnly Property LinePen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinePen {
	ForgeTypeId^ get ();
}
static member LinePen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace